<a href="https://colab.research.google.com/github/smilesrgouveia/Aula/blob/main/PL_Python_2_exercicio.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

<head>
  <meta name="author" content="Rogério de Oliveira">
  <meta institution="author" content="Universidade Presbiteriana Mackenzie">
</head>

<img src="http://meusite.mackenzie.br/rogerio/mackenzie_logo/UPM.2_horizontal_vermelho.jpg" width=300, align="right"> 

<h1 align=left><font size = 8, style="color:rgb(200,0,0)"><b>Ciência de Dados </b></font></h1> 
<h1 align=left><font size = 5, style="color:rgb(0,0,0)"><b>Paradigmas de Linguagens de
Programação para Ciência de Dados</b></font></h1> 

# 2 Seleção e Organização de Dados com Pandas
Professores: *Diego Nogare* & *Rogério de Oliveira* 

<br>
<br>

---

# Exercícios

Nos exercícios a seguir emprege a base de dados `titanic`.

Todos exercícios possuem várias soluções possíveis, mas não se preocupe com isso. A melhor solução é primeiro, a que funciona para você!

In [1]:
import numpy as np
import pandas as pd
import seaborn as sns
from random import choices

titanic = sns.load_dataset('titanic')
titanic.head()

   survived  pclass     sex   age  ...  deck  embark_town  alive  alone
0         0       3    male  22.0  ...   NaN  Southampton     no  False
1         1       1  female  38.0  ...     C    Cherbourg    yes  False
2         1       3  female  26.0  ...   NaN  Southampton    yes   True
3         1       1  female  35.0  ...     C  Southampton    yes  False
4         0       3    male  35.0  ...   NaN  Southampton     no   True

[5 rows x 15 columns]

1. Qual a quantidade de linhas e colunas de `titanic`?

In [3]:
# seu código
titanic.shape # nr de linhas e colunas
#len(titanic) # número de linhas

(891, 15)

2. Qual a idade do passageiro mais velho?

In [6]:
# seu código
titanic.describe(include='all')

          survived      pclass   sex         age  ...  deck  embark_town  alive alone
count   891.000000  891.000000   891  714.000000  ...   203          889    891   891
unique         NaN         NaN     2         NaN  ...     7            3      2     2
top            NaN         NaN  male         NaN  ...     C  Southampton     no  True
freq           NaN         NaN   577         NaN  ...    59          644    549   537
mean      0.383838    2.308642   NaN   29.699118  ...   NaN          NaN    NaN   NaN
std       0.486592    0.836071   NaN   14.526497  ...   NaN          NaN    NaN   NaN
min       0.000000    1.000000   NaN    0.420000  ...   NaN          NaN    NaN   NaN
25%       0.000000    2.000000   NaN   20.125000  ...   NaN          NaN    NaN   NaN
50%       0.000000    3.000000   NaN   28.000000  ...   NaN          NaN    NaN   NaN
75%       1.000000    3.000000   NaN   38.000000  ...   NaN          NaN    NaN   NaN
max       1.000000    3.000000   NaN   80.000000  ...   NaN          NaN    NaN   NaN

[11 rows x 15 columns]

3. Qual a idade da sobrevivente feminina mais velha?

In [17]:
# seu código
mulheres = titanic[ titanic.sex == 'female' ]
mulheres_velhas = mulheres.nlargest(1,'age')
mulheres_velhas

     survived  pclass     sex   age  ...  deck  embark_town  alive  alone
275         1       1  female  63.0  ...     D  Southampton    yes  False

[1 rows x 15 columns]

4. Qual o percentual de sobreviventes da primeira e terceira classes?

In [37]:
# seu código
psg_prim = titanic[ titanic.pclass == 1 ]
psg_terc = titanic[ titanic.pclass == 3 ]

sobrevive = titanic[ titanic.survived == 1 ]
vivo_psg_prim = sobrevive[ sobrevive.pclass == 1 ]
vivo_psg_terc = sobrevive[ sobrevive.pclass == 3 ]

print( sobrevive )

print(f'total { len( titanic ) }')
print(f'Sobrevivente { len( sobrevive ) }')
print(f'primeira { len( psg_prim ) }')
print(f'terceira { len( psg_terc ) }')
print(f'Percentual de Clientes vivo primeira classe {len( vivo_psg_prim ) / len( psg_prim ) } %')
print(f'Percentual de Clientes vivo terceira classe {len( vivo_psg_terc ) / len( psg_terc ) } %')

     survived  pclass     sex   age  ...  deck  embark_town  alive  alone
1           1       1  female  38.0  ...     C    Cherbourg    yes  False
2           1       3  female  26.0  ...   NaN  Southampton    yes   True
3           1       1  female  35.0  ...     C  Southampton    yes  False
8           1       3  female  27.0  ...   NaN  Southampton    yes  False
9           1       2  female  14.0  ...   NaN    Cherbourg    yes  False
..        ...     ...     ...   ...  ...   ...          ...    ...    ...
875         1       3  female  15.0  ...   NaN    Cherbourg    yes   True
879         1       1  female  56.0  ...     C    Cherbourg    yes  False
880         1       2  female  25.0  ...   NaN  Southampton    yes  False
887         1       1  female  19.0  ...     B  Southampton    yes   True
889         1       1    male  26.0  ...     C    Cherbourg    yes   True

[342 rows x 15 columns]
total 891
Sobrevivente 342
primeira 216
terceira 491
Percentual de Clientes vivo primeira classe 0.6296296296296297 %
Percentual de Clientes vivo terceira classe 0.24236252545824846 %

5. Analise a média de idade dos passageiros por classe e sexo (sugestão: empregue groupby). Você pode notar que?

In [44]:
# seu código
#display( pedidos.groupby( ['Itens','Pedido'] ).agg(['min','max']) )
display( titanic.groupby( ['pclass'] ).mean() )

display( titanic.groupby( ['sex','pclass'] ).mean() )

        survived        age     sibsp  ...       fare  adult_male     alone
pclass                                 ...
1       0.629630  38.233441  0.416667  ...  84.154687    0.550926  0.504630
2       0.472826  29.877630  0.402174  ...  20.662183    0.538043  0.565217
3       0.242363  25.140620  0.615071  ...  13.675550    0.649695  0.659878

[3 rows x 7 columns]

               survived        age     sibsp  ...        fare  adult_male     alone
sex    pclass                                 ...
female 1       0.968085  34.611765  0.553191  ...  106.125798    0.000000  0.361702
       2       0.921053  28.722973  0.486842  ...   21.970121    0.000000  0.421053
       3       0.500000  21.750000  0.895833  ...   16.118810    0.000000  0.416667
male   1       0.368852  41.281386  0.311475  ...   67.226127    0.975410  0.614754
       2       0.157407  30.740707  0.342593  ...   19.741782    0.916667  0.666667
       3       0.135447  26.507589  0.498559  ...   12.661633    0.919308  0.760807

[6 rows x 7 columns]